Reports/СправкаОбОплатеТрудаПоКатегориямСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>СправкаОбОплатеТрудаПоКатегориямСотрудников</Name>
		</Properties>
	</Report>
</MetaDataObject>

CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ДанныеПроизводственногоКалендаря</Schedule>
			<ScheduleValue>InformationRegister.ДанныеПроизводственногоКалендаря.Resource.ЗначениеДней</ScheduleValue>
			<ScheduleDate>InformationRegister.ДанныеПроизводственногоКалендаря.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ВидыНачислений</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтражения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗаработнойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьСчетУчетаЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьСтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Enums/КатегорииДолжностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>КатегорииДолжностей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпециалистыИСлужащие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повременщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сдельщики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеСлужащие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Специалисты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инженеры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Служащие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Командировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Командировка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОВыплате</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеОВыплатеПитание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеКомандировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатратИДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суточные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проживание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Питание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проездные</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/СправкаОбОплатеТрудаПоКатегориямСотрудников/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Описание = НСтр("ru = 'Справка об оплате труда по категориям сотрудников.'");

	НастройкиВарианта.НастройкиДляПоиска.НаименованияПолей =
		НСтр("ru = 'Категория работающих
		|Заработная плата
		|в т.ч. премия из ФОТ
		|Итого по предприятию 
		|Командировочные (470 вид)'");
	НастройкиВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов =
		НСтр("ru = 'НачалоПериода
		|КонецПериода
		|Организация'");
	НастройкиВарианта.НастройкиДляПоиска.КлючевыеСлова = НСтр("ru = 'Справка об оплате труда по категориям сотрудников'");
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Процедура формирования отчета.
//
// Параметры:
// ПараметрыОтчета - структура - набор параметров, необходимых для построения отчета.
// 	АдресХранилища - адрес временного хранилища.
Процедура Сформировать(СтруктураПараметров, АдресХранилища) Экспорт
	
	РезультатФормирования = Новый Структура("Результат, ОписаниеОшибки", Неопределено, "");
	СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования);
	ПоместитьВоВременноеХранилище(РезультатФормирования, АдресХранилища);
	
КонецПроцедуры

// Процедура - Сформировать табличный документ
//
// Параметры:
//  СтруктураПараметров	 - Структура - Параметры формирования отчета.
//  РезультатФормирования	 	- Структура - 
//
Процедура СформироватьТабличныйДокумент(СтруктураПараметров, РезультатФормирования)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "СправкаОбОплатеТрудаПоКатегориямСотрудников_ОплатаТрудаПоКатегориям";
	
	Организация = СтруктураПараметров.Организация;
	НачалоПериода = НачалоДня(СтруктураПараметров.НачалоПериода);
	КонецПериода = КонецДня(СтруктураПараметров.КонецПериода);
	
	Макет = ПолучитьМакет("ПФ_MXL_ОплатаТрудаПоКатегориям");

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.ПериодПредставление = ПредставлениеПериода(НачалоПериода, КонецПериода);
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
	ОбластьШапка.Параметры.Организация = Организация.НаименованиеПолное;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьВидНалога	= Макет.ПолучитьОбласть("ШапкаТаблицы");
    ТабличныйДокумент.Вывести(ОбластьВидНалога);	
	
	Запрос = Новый Запрос;
	ТекстЗапроса =		
	"ВЫБРАТЬ
	|	НачисленияЗаМесяц.Результат КАК СуммаЗП,
	|	НачисленияЗаМесяц.Должность.Категория,
	|	НачисленияЗаМесяц.ФизЛицо,
	|	НачисленияЗаМесяц.ВидРасчета
	|ПОМЕСТИТЬ ВременнаяТаблицаПоВсемКатегория
	|ИЗ
	|	РегистрРасчета.Начисления КАК НачисленияЗаМесяц
	|ГДЕ
	|	НачисленияЗаМесяц.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
	//|	И (НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ПерваяГруппаУТО)
	//|			ИЛИ НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ВтораяГруппаУТО)
	//|			ИЛИ НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ТретьяГруппа)
	//|			ИЛИ НачисленияЗаМесяц.ВидРасчета.ГруппаНачисления = ЗНАЧЕНИЕ(Справочник.ГруппыНачислений.ЧетвертаяГруппа))
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияЗаМесяц.Результат,
	|	НачисленияЗаМесяц.Должность.Категория,
	|	НачисленияЗаМесяц.ФизЛицо,
	|	НачисленияЗаМесяц.ВидРасчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	""Руководители"" КАК КатегорияОписание
	|ПОМЕСТИТЬ ВременнаяТаблицаНаименованияКатегорий
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Специалисты""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	""Инженеры""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	""Служащие""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	""Рабочие повременщики""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	""Рабочие сдельщики""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	""Прочие служащие""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	""Без категории""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПоВсемКатегория.ФизЛицо,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП КАК Размер
	|ПОМЕСТИТЬ ВременнаяТаблицаПремии
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|ГДЕ
	|	ПОДСТРОКА(ВременнаяТаблицаПоВсемКатегория.ВидРасчета.Код, 1, 3) = ""008""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПоВсемКатегория.ФизЛицо,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|ГДЕ
	|	ПОДСТРОКА(ВременнаяТаблицаПоВсемКатегория.ВидРасчета.Код, 1, 3) = ""011""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПоВсемКатегория.ФизЛицо,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|ГДЕ
	|	ПОДСТРОКА(ВременнаяТаблицаПоВсемКатегория.ВидРасчета.Код, 1, 3) = ""012""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаПремии.ФизЛицо,
	|	СУММА(ВременнаяТаблицаПремии.Размер) КАК Размер
	|ПОМЕСТИТЬ ВременнаяТаблицаПремииГруппировка
	|ИЗ
	|	ВременнаяТаблицаПремии КАК ВременнаяТаблицаПремии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремии.ФизЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Порядок,
	|	""Руководители"" КАК КатегорияОписание,
	|	СУММА(ВременнаяТаблицаПремииГруппировка.Размер) КАК СуммаПремии,
	|	СУММА(ВременнаяТаблицаПоВсемКатегория.СуммаЗП) КАК СуммаЗП
	|ПОМЕСТИТЬ ВременнаяТаблицаПоКатегориям
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Руководители)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	""Специалисты"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Специалисты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	""Инженеры"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Инженеры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	""Инженеры"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Служащие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	""Рабочие повременщики"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Повременщики)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	""Рабочие сдельщики"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.Сдельщики)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	""Прочие служащие"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.ПрочиеСлужащие)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8,
	|	""Без категории"",
	|	ВременнаяТаблицаПремииГруппировка.Размер,
	|	ВременнаяТаблицаПоВсемКатегория.СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаПоВсемКатегория КАК ВременнаяТаблицаПоВсемКатегория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПремииГруппировка КАК ВременнаяТаблицаПремииГруппировка
	|		ПО ВременнаяТаблицаПоВсемКатегория.ФизЛицо = ВременнаяТаблицаПремииГруппировка.ФизЛицо
	|ГДЕ
	|	ВременнаяТаблицаПоВсемКатегория.ДолжностьКатегория = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностей.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаНаименованияКатегорий.Порядок,
	|	ВременнаяТаблицаНаименованияКатегорий.КатегорияОписание КАК КатегорияОписание,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблицаПоКатегориям.СуммаПремии, 0)) КАК СуммаПремии,
	|	СУММА(ЕСТЬNULL(ВременнаяТаблицаПоКатегориям.СуммаЗП, 0)) КАК СуммаЗП
	|ИЗ
	|	ВременнаяТаблицаНаименованияКатегорий КАК ВременнаяТаблицаНаименованияКатегорий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПоКатегориям КАК ВременнаяТаблицаПоКатегориям
	|		ПО ВременнаяТаблицаНаименованияКатегорий.КатегорияОписание = ВременнаяТаблицаПоКатегориям.КатегорияОписание
	|			И ВременнаяТаблицаНаименованияКатегорий.Порядок = ВременнаяТаблицаПоКатегориям.Порядок
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблицаНаименованияКатегорий.КатегорияОписание,
	|	ВременнаяТаблицаНаименованияКатегорий.Порядок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВременнаяТаблицаНаименованияКатегорий.Порядок
	|ИТОГИ
	|	СУММА(СуммаПремии),
	|	СУММА(СуммаЗП)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("НачалоПериода",	НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",	КонецПериода);
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация = &Организация", "Истина");
	КонецЕсли;		
	
	Запрос.Текст = ТекстЗапроса;
	ВыборкаОбщая = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаОбщая.Следующий() Цикл									
		ВыборкаСтрока = ВыборкаОбщая.Выбрать();
		Пока ВыборкаСтрока.Следующий() Цикл
			ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрока);
		    ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;												
		ИтогОбщий	= Макет.ПолучитьОбласть("ИтогоПоПредприятию");
		ИтогОбщий.Параметры.Заполнить(ВыборкаОбщая);
		ТабличныйДокумент.Вывести(ИтогОбщий);
		
	КонецЦикла;
	
	// Выбираем командировочные
	//
	ТекстЗапроса =		
	"ВЫБРАТЬ
	|	СУММА(КомандировкаСотрудники.СуммаВсего) КАК Сумма
	|ИЗ
	|	Документ.Командировка.Сотрудники КАК КомандировкаСотрудники
	|ГДЕ
	|	КомандировкаСотрудники.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Запрос.Текст 	= ТекстЗапроса;
	Выборка 		= Запрос.Выполнить().Выбрать();	

	Если Выборка.Следующий() Тогда 
		ОбластьКомандировочные	= Макет.ПолучитьОбласть("СтрокаКомандировочные");
		ОбластьКомандировочные.Параметры.Заполнить(Выборка);
	    ТабличныйДокумент.Вывести(ОбластьКомандировочные);
	КонецЕсли;			
		
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	РезультатФормирования.Результат = ТабличныйДокумент;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
